#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Наименование = Данные.Наименование;
	Основание = Данные.ДействуетНаОсновании;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Представление = СтрШаблон("%1 (на осн. %2)",Наименование, НРег(Основание));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
